SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_txfront.h
/**************************************************************************//**
 * @file
 * @brief EFR32FG25 TXFRONT register and bit field definitions
 ******************************************************************************
 * # License
 * <b>Copyright 2021 Silicon Laboratories, Inc. www.silabs.com</b>
 ******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 *
 * The licensor of this software is Silicon Laboratories Inc.
 *
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 *****************************************************************************/
#ifndef EFR32FG25_TXFRONT_H
#define EFR32FG25_TXFRONT_H
#define TXFRONT_HAS_SET_CLEAR

/**************************************************************************//**
* @addtogroup Parts
* @{
******************************************************************************/
/**************************************************************************//**
 * @defgroup EFR32FG25_TXFRONT TXFRONT
 * @{
 * @brief EFR32FG25 TXFRONT Register Declaration.
 *****************************************************************************/

/** TXFRONT Register Declaration. */
typedef struct {
  __IM uint32_t  IPVERSION;                     /**< IP Version ID                                      */
  __IOM uint32_t EN;                            /**< Module Enable                                      */
  __IOM uint32_t SWRST;                         /**< Software Reset                                     */
  uint32_t       RESERVED0[1U];                 /**< Reserved for future use                            */
  __IOM uint32_t DISCLK;                        /**< Disable clk_per                                    */
  uint32_t       RESERVED1[59U];                /**< Reserved for future use                            */
  __IOM uint32_t INT1CFG;                       /**< New Register                                       */
  __IOM uint32_t INT1COEF01;                    /**< New Register                                       */
  __IOM uint32_t INT1COEF23;                    /**< New Register                                       */
  __IOM uint32_t INT1COEF45;                    /**< New Register                                       */
  __IOM uint32_t INT1COEF67;                    /**< New Register                                       */
  __IOM uint32_t INT1COEF89;                    /**< New Register                                       */
  __IOM uint32_t INT1COEF1011;                  /**< New Register                                       */
  __IOM uint32_t INT1COEF1213;                  /**< New Register                                       */
  __IOM uint32_t INT1COEF1415;                  /**< New Register                                       */
  __IOM uint32_t INT2CFG;                       /**< New Register                                       */
  __IOM uint32_t SRCCFG;                        /**< New Register                                       */
  __IOM uint32_t TXIQIMB;                       /**< New Register                                       */
  __IOM uint32_t TXDCOFFSET;                    /**< New Register                                       */
  __IOM uint32_t TXRAMPUP;                      /**< New Register                                       */
  __IOM uint32_t TXDCRAMPUP;                    /**< New Register                                       */
  __IOM uint32_t TXGAIN;                        /**< New Register                                       */
  __IOM uint32_t TXCLIP;                        /**< New Register                                       */
  __IOM uint32_t TXPREDIST;                     /**< New Register                                       */
  uint32_t       RESERVED2[2U];                 /**< Reserved for future use                            */
  __IOM uint32_t DAC;                           /**< New Register                                       */
  uint32_t       RESERVED3[939U];               /**< Reserved for future use                            */
  __IM uint32_t  IPVERSION_SET;                 /**< IP Version ID                                      */
  __IOM uint32_t EN_SET;                        /**< Module Enable                                      */
  __IOM uint32_t SWRST_SET;                     /**< Software Reset                                     */
  uint32_t       RESERVED4[1U];                 /**< Reserved for future use                            */
  __IOM uint32_t DISCLK_SET;                    /**< Disable clk_per                                    */
  uint32_t       RESERVED5[59U];                /**< Reserved for future use                            */
  __IOM uint32_t INT1CFG_SET;                   /**< New Register                                       */
  __IOM uint32_t INT1COEF01_SET;                /**< New Register                                       */
  __IOM uint32_t INT1COEF23_SET;                /**< New Register                                       */
  __IOM uint32_t INT1COEF45_SET;                /**< New Register                                       */
  __IOM uint32_t INT1COEF67_SET;                /**< New Register                                       */
  __IOM uint32_t INT1COEF89_SET;                /**< New Register                                       */
  __IOM uint32_t INT1COEF1011_SET;              /**< New Register                                       */
  __IOM uint32_t INT1COEF1213_SET;              /**< New Register                                       */
  __IOM uint32_t INT1COEF1415_SET;              /**< New Register                                       */
  __IOM uint32_t INT2CFG_SET;                   /**< New Register                                       */
  __IOM uint32_t SRCCFG_SET;                    /**< New Register                                       */
  __IOM uint32_t TXIQIMB_SET;                   /**< New Register                                       */
  __IOM uint32_t TXDCOFFSET_SET;                /**< New Register                                       */
  __IOM uint32_t TXRAMPUP_SET;                  /**< New Register                                       */
  __IOM uint32_t TXDCRAMPUP_SET;                /**< New Register                                       */
  __IOM uint32_t TXGAIN_SET;                    /**< New Register                                       */
  __IOM uint32_t TXCLIP_SET;                    /**< New Register                                       */
  __IOM uint32_t TXPREDIST_SET;                 /**< New Register                                       */
  uint32_t       RESERVED6[2U];                 /**< Reserved for future use                            */
  __IOM uint32_t DAC_SET;                       /**< New Register                                       */
  uint32_t       RESERVED7[939U];               /**< Reserved for future use                            */
  __IM uint32_t  IPVERSION_CLR;                 /**< IP Version ID                                      */
  __IOM uint32_t EN_CLR;                        /**< Module Enable                                      */
  __IOM uint32_t SWRST_CLR;                     /**< Software Reset                                     */
  uint32_t       RESERVED8[1U];                 /**< Reserved for future use                            */
  __IOM uint32_t DISCLK_CLR;                    /**< Disable clk_per                                    */
  uint32_t       RESERVED9[59U];                /**< Reserved for future use                            */
  __IOM uint32_t INT1CFG_CLR;                   /**< New Register                                       */
  __IOM uint32_t INT1COEF01_CLR;                /**< New Register                                       */
  __IOM uint32_t INT1COEF23_CLR;                /**< New Register                                       */
  __IOM uint32_t INT1COEF45_CLR;                /**< New Register                                       */
  __IOM uint32_t INT1COEF67_CLR;                /**< New Register                                       */
  __IOM uint32_t INT1COEF89_CLR;                /**< New Register                                       */
  __IOM uint32_t INT1COEF1011_CLR;              /**< New Register                                       */
  __IOM uint32_t INT1COEF1213_CLR;              /**< New Register                                       */
  __IOM uint32_t INT1COEF1415_CLR;              /**< New Register                                       */
  __IOM uint32_t INT2CFG_CLR;                   /**< New Register                                       */
  __IOM uint32_t SRCCFG_CLR;                    /**< New Register                                       */
  __IOM uint32_t TXIQIMB_CLR;                   /**< New Register                                       */
  __IOM uint32_t TXDCOFFSET_CLR;                /**< New Register                                       */
  __IOM uint32_t TXRAMPUP_CLR;                  /**< New Register                                       */
  __IOM uint32_t TXDCRAMPUP_CLR;                /**< New Register                                       */
  __IOM uint32_t TXGAIN_CLR;                    /**< New Register                                       */
  __IOM uint32_t TXCLIP_CLR;                    /**< New Register                                       */
  __IOM uint32_t TXPREDIST_CLR;                 /**< New Register                                       */
  uint32_t       RESERVED10[2U];                /**< Reserved for future use                            */
  __IOM uint32_t DAC_CLR;                       /**< New Register                                       */
  uint32_t       RESERVED11[939U];              /**< Reserved for future use                            */
  __IM uint32_t  IPVERSION_TGL;                 /**< IP Version ID                                      */
  __IOM uint32_t EN_TGL;                        /**< Module Enable                                      */
  __IOM uint32_t SWRST_TGL;                     /**< Software Reset                                     */
  uint32_t       RESERVED12[1U];                /**< Reserved for future use                            */
  __IOM uint32_t DISCLK_TGL;                    /**< Disable clk_per                                    */
  uint32_t       RESERVED13[59U];               /**< Reserved for future use                            */
  __IOM uint32_t INT1CFG_TGL;                   /**< New Register                                       */
  __IOM uint32_t INT1COEF01_TGL;                /**< New Register                                       */
  __IOM uint32_t INT1COEF23_TGL;                /**< New Register                                       */
  __IOM uint32_t INT1COEF45_TGL;                /**< New Register                                       */
  __IOM uint32_t INT1COEF67_TGL;                /**< New Register                                       */
  __IOM uint32_t INT1COEF89_TGL;                /**< New Register                                       */
  __IOM uint32_t INT1COEF1011_TGL;              /**< New Register                                       */
  __IOM uint32_t INT1COEF1213_TGL;              /**< New Register                                       */
  __IOM uint32_t INT1COEF1415_TGL;              /**< New Register                                       */
  __IOM uint32_t INT2CFG_TGL;                   /**< New Register                                       */
  __IOM uint32_t SRCCFG_TGL;                    /**< New Register                                       */
  __IOM uint32_t TXIQIMB_TGL;                   /**< New Register                                       */
  __IOM uint32_t TXDCOFFSET_TGL;                /**< New Register                                       */
  __IOM uint32_t TXRAMPUP_TGL;                  /**< New Register                                       */
  __IOM uint32_t TXDCRAMPUP_TGL;                /**< New Register                                       */
  __IOM uint32_t TXGAIN_TGL;                    /**< New Register                                       */
  __IOM uint32_t TXCLIP_TGL;                    /**< New Register                                       */
  __IOM uint32_t TXPREDIST_TGL;                 /**< New Register                                       */
  uint32_t       RESERVED14[2U];                /**< Reserved for future use                            */
  __IOM uint32_t DAC_TGL;                       /**< New Register                                       */
} TXFRONT_TypeDef;
/** @} End of group EFR32FG25_TXFRONT */

/**************************************************************************//**
 * @addtogroup EFR32FG25_TXFRONT
 * @{
 * @defgroup EFR32FG25_TXFRONT_BitFields TXFRONT Bit Fields
 * @{
 *****************************************************************************/

/* Bit fields for TXFRONT IPVERSION */
#define _TXFRONT_IPVERSION_RESETVALUE            0x00000001UL                                /**< Default value for TXFRONT_IPVERSION         */
#define _TXFRONT_IPVERSION_MASK                  0xFFFFFFFFUL                                /**< Mask for TXFRONT_IPVERSION                  */
#define _TXFRONT_IPVERSION_IPVERSION_SHIFT       0                                           /**< Shift value for TXFRONT_IPVERSION           */
#define _TXFRONT_IPVERSION_IPVERSION_MASK        0xFFFFFFFFUL                                /**< Bit mask for TXFRONT_IPVERSION              */
#define _TXFRONT_IPVERSION_IPVERSION_DEFAULT     0x00000001UL                                /**< Mode DEFAULT for TXFRONT_IPVERSION          */
#define TXFRONT_IPVERSION_IPVERSION_DEFAULT      (_TXFRONT_IPVERSION_IPVERSION_DEFAULT << 0) /**< Shifted mode DEFAULT for TXFRONT_IPVERSION  */

/* Bit fields for TXFRONT EN */
#define _TXFRONT_EN_RESETVALUE                   0x00000000UL                           /**< Default value for TXFRONT_EN                */
#define _TXFRONT_EN_MASK                         0x00000003UL                           /**< Mask for TXFRONT_EN                         */
#define TXFRONT_EN_EN                            (0x1UL << 0)                           /**< Module Enable                               */
#define _TXFRONT_EN_EN_SHIFT                     0                                      /**< Shift value for TXFRONT_EN                  */
#define _TXFRONT_EN_EN_MASK                      0x1UL                                  /**< Bit mask for TXFRONT_EN                     */
#define _TXFRONT_EN_EN_DEFAULT                   0x00000000UL                           /**< Mode DEFAULT for TXFRONT_EN                 */
#define TXFRONT_EN_EN_DEFAULT                    (_TXFRONT_EN_EN_DEFAULT << 0)          /**< Shifted mode DEFAULT for TXFRONT_EN         */
#define TXFRONT_EN_DISABLING                     (0x1UL << 1)                           /**< Disablement Busy Status                     */
#define _TXFRONT_EN_DISABLING_SHIFT              1                                      /**< Shift value for TXFRONT_DISABLING           */
#define _TXFRONT_EN_DISABLING_MASK               0x2UL                                  /**< Bit mask for TXFRONT_DISABLING              */
#define _TXFRONT_EN_DISABLING_DEFAULT            0x00000000UL                           /**< Mode DEFAULT for TXFRONT_EN                 */
#define TXFRONT_EN_DISABLING_DEFAULT             (_TXFRONT_EN_DISABLING_DEFAULT << 1)   /**< Shifted mode DEFAULT for TXFRONT_EN         */

