SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_txfront.h
/* Bit fields for TXFRONT SWRST */
#define _TXFRONT_SWRST_RESETVALUE                0x00000000UL                            /**< Default value for TXFRONT_SWRST             */
#define _TXFRONT_SWRST_MASK                      0x00000003UL                            /**< Mask for TXFRONT_SWRST                      */
#define TXFRONT_SWRST_SWRST                      (0x1UL << 0)                            /**< Software Reset Command                      */
#define _TXFRONT_SWRST_SWRST_SHIFT               0                                       /**< Shift value for TXFRONT_SWRST               */
#define _TXFRONT_SWRST_SWRST_MASK                0x1UL                                   /**< Bit mask for TXFRONT_SWRST                  */
#define _TXFRONT_SWRST_SWRST_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for TXFRONT_SWRST              */
#define TXFRONT_SWRST_SWRST_DEFAULT              (_TXFRONT_SWRST_SWRST_DEFAULT << 0)     /**< Shifted mode DEFAULT for TXFRONT_SWRST      */
#define TXFRONT_SWRST_RESETTING                  (0x1UL << 1)                            /**< Software Reset Busy Status                  */
#define _TXFRONT_SWRST_RESETTING_SHIFT           1                                       /**< Shift value for TXFRONT_RESETTING           */
#define _TXFRONT_SWRST_RESETTING_MASK            0x2UL                                   /**< Bit mask for TXFRONT_RESETTING              */
#define _TXFRONT_SWRST_RESETTING_DEFAULT         0x00000000UL                            /**< Mode DEFAULT for TXFRONT_SWRST              */
#define TXFRONT_SWRST_RESETTING_DEFAULT          (_TXFRONT_SWRST_RESETTING_DEFAULT << 1) /**< Shifted mode DEFAULT for TXFRONT_SWRST      */

/* Bit fields for TXFRONT DISCLK */
#define _TXFRONT_DISCLK_RESETVALUE               0x00000000UL                           /**< Default value for TXFRONT_DISCLK            */
#define _TXFRONT_DISCLK_MASK                     0x00000001UL                           /**< Mask for TXFRONT_DISCLK                     */
#define TXFRONT_DISCLK_DISCLK                    (0x1UL << 0)                           /**< New BitField                                */
#define _TXFRONT_DISCLK_DISCLK_SHIFT             0                                      /**< Shift value for TXFRONT_DISCLK              */
#define _TXFRONT_DISCLK_DISCLK_MASK              0x1UL                                  /**< Bit mask for TXFRONT_DISCLK                 */
#define _TXFRONT_DISCLK_DISCLK_DEFAULT           0x00000000UL                           /**< Mode DEFAULT for TXFRONT_DISCLK             */
#define TXFRONT_DISCLK_DISCLK_DEFAULT            (_TXFRONT_DISCLK_DISCLK_DEFAULT << 0)  /**< Shifted mode DEFAULT for TXFRONT_DISCLK     */

/* Bit fields for TXFRONT INT1CFG */
#define _TXFRONT_INT1CFG_RESETVALUE              0x000000C7UL                              /**< Default value for TXFRONT_INT1CFG           */
#define _TXFRONT_INT1CFG_MASK                    0x000001FFUL                              /**< Mask for TXFRONT_INT1CFG                    */
#define _TXFRONT_INT1CFG_RATIO_SHIFT             0                                         /**< Shift value for TXFRONT_RATIO               */
#define _TXFRONT_INT1CFG_RATIO_MASK              0xFUL                                     /**< Bit mask for TXFRONT_RATIO                  */
#define _TXFRONT_INT1CFG_RATIO_DEFAULT           0x00000007UL                              /**< Mode DEFAULT for TXFRONT_INT1CFG            */
#define TXFRONT_INT1CFG_RATIO_DEFAULT            (_TXFRONT_INT1CFG_RATIO_DEFAULT << 0)     /**< Shifted mode DEFAULT for TXFRONT_INT1CFG    */
#define _TXFRONT_INT1CFG_GAINSHIFT_SHIFT         4                                         /**< Shift value for TXFRONT_GAINSHIFT           */
#define _TXFRONT_INT1CFG_GAINSHIFT_MASK          0x1F0UL                                   /**< Bit mask for TXFRONT_GAINSHIFT              */
#define _TXFRONT_INT1CFG_GAINSHIFT_DEFAULT       0x0000000CUL                              /**< Mode DEFAULT for TXFRONT_INT1CFG            */
#define TXFRONT_INT1CFG_GAINSHIFT_DEFAULT        (_TXFRONT_INT1CFG_GAINSHIFT_DEFAULT << 4) /**< Shifted mode DEFAULT for TXFRONT_INT1CFG    */

/* Bit fields for TXFRONT INT1COEF01 */
#define _TXFRONT_INT1COEF01_RESETVALUE           0x00000000UL                               /**< Default value for TXFRONT_INT1COEF01        */
#define _TXFRONT_INT1COEF01_MASK                 0x7FFF7FFFUL                               /**< Mask for TXFRONT_INT1COEF01                 */
#define _TXFRONT_INT1COEF01_COEFF0_SHIFT         0                                          /**< Shift value for TXFRONT_COEFF0              */
#define _TXFRONT_INT1COEF01_COEFF0_MASK          0x7FFFUL                                   /**< Bit mask for TXFRONT_COEFF0                 */
#define _TXFRONT_INT1COEF01_COEFF0_DEFAULT       0x00000000UL                               /**< Mode DEFAULT for TXFRONT_INT1COEF01         */
#define TXFRONT_INT1COEF01_COEFF0_DEFAULT        (_TXFRONT_INT1COEF01_COEFF0_DEFAULT << 0)  /**< Shifted mode DEFAULT for TXFRONT_INT1COEF01 */
#define _TXFRONT_INT1COEF01_COEFF1_SHIFT         16                                         /**< Shift value for TXFRONT_COEFF1              */
#define _TXFRONT_INT1COEF01_COEFF1_MASK          0x7FFF0000UL                               /**< Bit mask for TXFRONT_COEFF1                 */
#define _TXFRONT_INT1COEF01_COEFF1_DEFAULT       0x00000000UL                               /**< Mode DEFAULT for TXFRONT_INT1COEF01         */
#define TXFRONT_INT1COEF01_COEFF1_DEFAULT        (_TXFRONT_INT1COEF01_COEFF1_DEFAULT << 16) /**< Shifted mode DEFAULT for TXFRONT_INT1COEF01 */

/* Bit fields for TXFRONT INT1COEF23 */
#define _TXFRONT_INT1COEF23_RESETVALUE           0x00000000UL                               /**< Default value for TXFRONT_INT1COEF23        */
#define _TXFRONT_INT1COEF23_MASK                 0x7FFF7FFFUL                               /**< Mask for TXFRONT_INT1COEF23                 */
#define _TXFRONT_INT1COEF23_COEFF2_SHIFT         0                                          /**< Shift value for TXFRONT_COEFF2              */
#define _TXFRONT_INT1COEF23_COEFF2_MASK          0x7FFFUL                                   /**< Bit mask for TXFRONT_COEFF2                 */
#define _TXFRONT_INT1COEF23_COEFF2_DEFAULT       0x00000000UL                               /**< Mode DEFAULT for TXFRONT_INT1COEF23         */
#define TXFRONT_INT1COEF23_COEFF2_DEFAULT        (_TXFRONT_INT1COEF23_COEFF2_DEFAULT << 0)  /**< Shifted mode DEFAULT for TXFRONT_INT1COEF23 */
#define _TXFRONT_INT1COEF23_COEFF3_SHIFT         16                                         /**< Shift value for TXFRONT_COEFF3              */
#define _TXFRONT_INT1COEF23_COEFF3_MASK          0x7FFF0000UL                               /**< Bit mask for TXFRONT_COEFF3                 */
#define _TXFRONT_INT1COEF23_COEFF3_DEFAULT       0x00000000UL                               /**< Mode DEFAULT for TXFRONT_INT1COEF23         */
#define TXFRONT_INT1COEF23_COEFF3_DEFAULT        (_TXFRONT_INT1COEF23_COEFF3_DEFAULT << 16) /**< Shifted mode DEFAULT for TXFRONT_INT1COEF23 */

/* Bit fields for TXFRONT INT1COEF45 */
#define _TXFRONT_INT1COEF45_RESETVALUE           0x00000000UL                               /**< Default value for TXFRONT_INT1COEF45        */
#define _TXFRONT_INT1COEF45_MASK                 0x7FFF7FFFUL                               /**< Mask for TXFRONT_INT1COEF45                 */
#define _TXFRONT_INT1COEF45_COEFF4_SHIFT         0                                          /**< Shift value for TXFRONT_COEFF4              */
#define _TXFRONT_INT1COEF45_COEFF4_MASK          0x7FFFUL                                   /**< Bit mask for TXFRONT_COEFF4                 */
#define _TXFRONT_INT1COEF45_COEFF4_DEFAULT       0x00000000UL                               /**< Mode DEFAULT for TXFRONT_INT1COEF45         */
#define TXFRONT_INT1COEF45_COEFF4_DEFAULT        (_TXFRONT_INT1COEF45_COEFF4_DEFAULT << 0)  /**< Shifted mode DEFAULT for TXFRONT_INT1COEF45 */
#define _TXFRONT_INT1COEF45_COEFF5_SHIFT         16                                         /**< Shift value for TXFRONT_COEFF5              */
#define _TXFRONT_INT1COEF45_COEFF5_MASK          0x7FFF0000UL                               /**< Bit mask for TXFRONT_COEFF5                 */
#define _TXFRONT_INT1COEF45_COEFF5_DEFAULT       0x00000000UL                               /**< Mode DEFAULT for TXFRONT_INT1COEF45         */
#define TXFRONT_INT1COEF45_COEFF5_DEFAULT        (_TXFRONT_INT1COEF45_COEFF5_DEFAULT << 16) /**< Shifted mode DEFAULT for TXFRONT_INT1COEF45 */

/* Bit fields for TXFRONT INT1COEF67 */
#define _TXFRONT_INT1COEF67_RESETVALUE           0x00000000UL                               /**< Default value for TXFRONT_INT1COEF67        */
#define _TXFRONT_INT1COEF67_MASK                 0x7FFF7FFFUL                               /**< Mask for TXFRONT_INT1COEF67                 */
#define _TXFRONT_INT1COEF67_COEFF6_SHIFT         0                                          /**< Shift value for TXFRONT_COEFF6              */
#define _TXFRONT_INT1COEF67_COEFF6_MASK          0x7FFFUL                                   /**< Bit mask for TXFRONT_COEFF6                 */
#define _TXFRONT_INT1COEF67_COEFF6_DEFAULT       0x00000000UL                               /**< Mode DEFAULT for TXFRONT_INT1COEF67         */
#define TXFRONT_INT1COEF67_COEFF6_DEFAULT        (_TXFRONT_INT1COEF67_COEFF6_DEFAULT << 0)  /**< Shifted mode DEFAULT for TXFRONT_INT1COEF67 */
#define _TXFRONT_INT1COEF67_COEFF7_SHIFT         16                                         /**< Shift value for TXFRONT_COEFF7              */
#define _TXFRONT_INT1COEF67_COEFF7_MASK          0x7FFF0000UL                               /**< Bit mask for TXFRONT_COEFF7                 */
#define _TXFRONT_INT1COEF67_COEFF7_DEFAULT       0x00000000UL                               /**< Mode DEFAULT for TXFRONT_INT1COEF67         */
#define TXFRONT_INT1COEF67_COEFF7_DEFAULT        (_TXFRONT_INT1COEF67_COEFF7_DEFAULT << 16) /**< Shifted mode DEFAULT for TXFRONT_INT1COEF67 */

