SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_txfront.h
/* Bit fields for TXFRONT INT1COEF89 */
#define _TXFRONT_INT1COEF89_RESETVALUE           0x00000000UL                               /**< Default value for TXFRONT_INT1COEF89        */
#define _TXFRONT_INT1COEF89_MASK                 0x7FFF7FFFUL                               /**< Mask for TXFRONT_INT1COEF89                 */
#define _TXFRONT_INT1COEF89_COEFF8_SHIFT         0                                          /**< Shift value for TXFRONT_COEFF8              */
#define _TXFRONT_INT1COEF89_COEFF8_MASK          0x7FFFUL                                   /**< Bit mask for TXFRONT_COEFF8                 */
#define _TXFRONT_INT1COEF89_COEFF8_DEFAULT       0x00000000UL                               /**< Mode DEFAULT for TXFRONT_INT1COEF89         */
#define TXFRONT_INT1COEF89_COEFF8_DEFAULT        (_TXFRONT_INT1COEF89_COEFF8_DEFAULT << 0)  /**< Shifted mode DEFAULT for TXFRONT_INT1COEF89 */
#define _TXFRONT_INT1COEF89_COEFF9_SHIFT         16                                         /**< Shift value for TXFRONT_COEFF9              */
#define _TXFRONT_INT1COEF89_COEFF9_MASK          0x7FFF0000UL                               /**< Bit mask for TXFRONT_COEFF9                 */
#define _TXFRONT_INT1COEF89_COEFF9_DEFAULT       0x00000000UL                               /**< Mode DEFAULT for TXFRONT_INT1COEF89         */
#define TXFRONT_INT1COEF89_COEFF9_DEFAULT        (_TXFRONT_INT1COEF89_COEFF9_DEFAULT << 16) /**< Shifted mode DEFAULT for TXFRONT_INT1COEF89 */

/* Bit fields for TXFRONT INT1COEF1011 */
#define _TXFRONT_INT1COEF1011_RESETVALUE         0x00000000UL                                  /**< Default value for TXFRONT_INT1COEF1011      */
#define _TXFRONT_INT1COEF1011_MASK               0x7FFF7FFFUL                                  /**< Mask for TXFRONT_INT1COEF1011               */
#define _TXFRONT_INT1COEF1011_COEFF10_SHIFT      0                                             /**< Shift value for TXFRONT_COEFF10             */
#define _TXFRONT_INT1COEF1011_COEFF10_MASK       0x7FFFUL                                      /**< Bit mask for TXFRONT_COEFF10                */
#define _TXFRONT_INT1COEF1011_COEFF10_DEFAULT    0x00000000UL                                  /**< Mode DEFAULT for TXFRONT_INT1COEF1011       */
#define TXFRONT_INT1COEF1011_COEFF10_DEFAULT     (_TXFRONT_INT1COEF1011_COEFF10_DEFAULT << 0)  /**< Shifted mode DEFAULT for TXFRONT_INT1COEF1011*/
#define _TXFRONT_INT1COEF1011_COEFF11_SHIFT      16                                            /**< Shift value for TXFRONT_COEFF11             */
#define _TXFRONT_INT1COEF1011_COEFF11_MASK       0x7FFF0000UL                                  /**< Bit mask for TXFRONT_COEFF11                */
#define _TXFRONT_INT1COEF1011_COEFF11_DEFAULT    0x00000000UL                                  /**< Mode DEFAULT for TXFRONT_INT1COEF1011       */
#define TXFRONT_INT1COEF1011_COEFF11_DEFAULT     (_TXFRONT_INT1COEF1011_COEFF11_DEFAULT << 16) /**< Shifted mode DEFAULT for TXFRONT_INT1COEF1011*/

/* Bit fields for TXFRONT INT1COEF1213 */
#define _TXFRONT_INT1COEF1213_RESETVALUE         0x00000000UL                                  /**< Default value for TXFRONT_INT1COEF1213      */
#define _TXFRONT_INT1COEF1213_MASK               0x7FFF7FFFUL                                  /**< Mask for TXFRONT_INT1COEF1213               */
#define _TXFRONT_INT1COEF1213_COEFF12_SHIFT      0                                             /**< Shift value for TXFRONT_COEFF12             */
#define _TXFRONT_INT1COEF1213_COEFF12_MASK       0x7FFFUL                                      /**< Bit mask for TXFRONT_COEFF12                */
#define _TXFRONT_INT1COEF1213_COEFF12_DEFAULT    0x00000000UL                                  /**< Mode DEFAULT for TXFRONT_INT1COEF1213       */
#define TXFRONT_INT1COEF1213_COEFF12_DEFAULT     (_TXFRONT_INT1COEF1213_COEFF12_DEFAULT << 0)  /**< Shifted mode DEFAULT for TXFRONT_INT1COEF1213*/
#define _TXFRONT_INT1COEF1213_COEFF13_SHIFT      16                                            /**< Shift value for TXFRONT_COEFF13             */
#define _TXFRONT_INT1COEF1213_COEFF13_MASK       0x7FFF0000UL                                  /**< Bit mask for TXFRONT_COEFF13                */
#define _TXFRONT_INT1COEF1213_COEFF13_DEFAULT    0x00000000UL                                  /**< Mode DEFAULT for TXFRONT_INT1COEF1213       */
#define TXFRONT_INT1COEF1213_COEFF13_DEFAULT     (_TXFRONT_INT1COEF1213_COEFF13_DEFAULT << 16) /**< Shifted mode DEFAULT for TXFRONT_INT1COEF1213*/

/* Bit fields for TXFRONT INT1COEF1415 */
#define _TXFRONT_INT1COEF1415_RESETVALUE         0x00000000UL                                  /**< Default value for TXFRONT_INT1COEF1415      */
#define _TXFRONT_INT1COEF1415_MASK               0x7FFF7FFFUL                                  /**< Mask for TXFRONT_INT1COEF1415               */
#define _TXFRONT_INT1COEF1415_COEFF14_SHIFT      0                                             /**< Shift value for TXFRONT_COEFF14             */
#define _TXFRONT_INT1COEF1415_COEFF14_MASK       0x7FFFUL                                      /**< Bit mask for TXFRONT_COEFF14                */
#define _TXFRONT_INT1COEF1415_COEFF14_DEFAULT    0x00000000UL                                  /**< Mode DEFAULT for TXFRONT_INT1COEF1415       */
#define TXFRONT_INT1COEF1415_COEFF14_DEFAULT     (_TXFRONT_INT1COEF1415_COEFF14_DEFAULT << 0)  /**< Shifted mode DEFAULT for TXFRONT_INT1COEF1415*/
#define _TXFRONT_INT1COEF1415_COEFF15_SHIFT      16                                            /**< Shift value for TXFRONT_COEFF15             */
#define _TXFRONT_INT1COEF1415_COEFF15_MASK       0x7FFF0000UL                                  /**< Bit mask for TXFRONT_COEFF15                */
#define _TXFRONT_INT1COEF1415_COEFF15_DEFAULT    0x00000000UL                                  /**< Mode DEFAULT for TXFRONT_INT1COEF1415       */
#define TXFRONT_INT1COEF1415_COEFF15_DEFAULT     (_TXFRONT_INT1COEF1415_COEFF15_DEFAULT << 16) /**< Shifted mode DEFAULT for TXFRONT_INT1COEF1415*/

/* Bit fields for TXFRONT INT2CFG */
#define _TXFRONT_INT2CFG_RESETVALUE              0x00000802UL                               /**< Default value for TXFRONT_INT2CFG           */
#define _TXFRONT_INT2CFG_MASK                    0x00007FFFUL                               /**< Mask for TXFRONT_INT2CFG                    */
#define _TXFRONT_INT2CFG_RATIO_SHIFT             0                                          /**< Shift value for TXFRONT_RATIO               */
#define _TXFRONT_INT2CFG_RATIO_MASK              0x3FFUL                                    /**< Bit mask for TXFRONT_RATIO                  */
#define _TXFRONT_INT2CFG_RATIO_DEFAULT           0x00000002UL                               /**< Mode DEFAULT for TXFRONT_INT2CFG            */
#define TXFRONT_INT2CFG_RATIO_DEFAULT            (_TXFRONT_INT2CFG_RATIO_DEFAULT << 0)      /**< Shifted mode DEFAULT for TXFRONT_INT2CFG    */
#define _TXFRONT_INT2CFG_GAINSHIFT_SHIFT         10                                         /**< Shift value for TXFRONT_GAINSHIFT           */
#define _TXFRONT_INT2CFG_GAINSHIFT_MASK          0x7C00UL                                   /**< Bit mask for TXFRONT_GAINSHIFT              */
#define _TXFRONT_INT2CFG_GAINSHIFT_DEFAULT       0x00000002UL                               /**< Mode DEFAULT for TXFRONT_INT2CFG            */
#define TXFRONT_INT2CFG_GAINSHIFT_DEFAULT        (_TXFRONT_INT2CFG_GAINSHIFT_DEFAULT << 10) /**< Shifted mode DEFAULT for TXFRONT_INT2CFG    */

/* Bit fields for TXFRONT SRCCFG */
#define _TXFRONT_SRCCFG_RESETVALUE               0x00000002UL                           /**< Default value for TXFRONT_SRCCFG            */
#define _TXFRONT_SRCCFG_MASK                     0x0007FFFFUL                           /**< Mask for TXFRONT_SRCCFG                     */
#define _TXFRONT_SRCCFG_RATIO_SHIFT              0                                      /**< Shift value for TXFRONT_RATIO               */
#define _TXFRONT_SRCCFG_RATIO_MASK               0x7FFFFUL                              /**< Bit mask for TXFRONT_RATIO                  */
#define _TXFRONT_SRCCFG_RATIO_DEFAULT            0x00000002UL                           /**< Mode DEFAULT for TXFRONT_SRCCFG             */
#define TXFRONT_SRCCFG_RATIO_DEFAULT             (_TXFRONT_SRCCFG_RATIO_DEFAULT << 0)   /**< Shifted mode DEFAULT for TXFRONT_SRCCFG     */

/* Bit fields for TXFRONT TXIQIMB */
#define _TXFRONT_TXIQIMB_RESETVALUE              0x00000000UL                            /**< Default value for TXFRONT_TXIQIMB           */
#define _TXFRONT_TXIQIMB_MASK                    0x0FFF0FFFUL                            /**< Mask for TXFRONT_TXIQIMB                    */
#define _TXFRONT_TXIQIMB_EPSILON_SHIFT           0                                       /**< Shift value for TXFRONT_EPSILON             */
#define _TXFRONT_TXIQIMB_EPSILON_MASK            0xFFFUL                                 /**< Bit mask for TXFRONT_EPSILON                */
#define _TXFRONT_TXIQIMB_EPSILON_DEFAULT         0x00000000UL                            /**< Mode DEFAULT for TXFRONT_TXIQIMB            */
#define TXFRONT_TXIQIMB_EPSILON_DEFAULT          (_TXFRONT_TXIQIMB_EPSILON_DEFAULT << 0) /**< Shifted mode DEFAULT for TXFRONT_TXIQIMB    */
#define _TXFRONT_TXIQIMB_PHI_SHIFT               16                                      /**< Shift value for TXFRONT_PHI                 */
#define _TXFRONT_TXIQIMB_PHI_MASK                0xFFF0000UL                             /**< Bit mask for TXFRONT_PHI                    */
#define _TXFRONT_TXIQIMB_PHI_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for TXFRONT_TXIQIMB            */
#define TXFRONT_TXIQIMB_PHI_DEFAULT              (_TXFRONT_TXIQIMB_PHI_DEFAULT << 16)    /**< Shifted mode DEFAULT for TXFRONT_TXIQIMB    */

