SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_txfront.h
/* Bit fields for TXFRONT TXDCOFFSET */
#define _TXFRONT_TXDCOFFSET_RESETVALUE           0x00000000UL                                  /**< Default value for TXFRONT_TXDCOFFSET        */
#define _TXFRONT_TXDCOFFSET_MASK                 0x03FF03FFUL                                  /**< Mask for TXFRONT_TXDCOFFSET                 */
#define _TXFRONT_TXDCOFFSET_DCOFFSETI_SHIFT      0                                             /**< Shift value for TXFRONT_DCOFFSETI           */
#define _TXFRONT_TXDCOFFSET_DCOFFSETI_MASK       0x3FFUL                                       /**< Bit mask for TXFRONT_DCOFFSETI              */
#define _TXFRONT_TXDCOFFSET_DCOFFSETI_DEFAULT    0x00000000UL                                  /**< Mode DEFAULT for TXFRONT_TXDCOFFSET         */
#define TXFRONT_TXDCOFFSET_DCOFFSETI_DEFAULT     (_TXFRONT_TXDCOFFSET_DCOFFSETI_DEFAULT << 0)  /**< Shifted mode DEFAULT for TXFRONT_TXDCOFFSET */
#define _TXFRONT_TXDCOFFSET_DCOFFSETQ_SHIFT      16                                            /**< Shift value for TXFRONT_DCOFFSETQ           */
#define _TXFRONT_TXDCOFFSET_DCOFFSETQ_MASK       0x3FF0000UL                                   /**< Bit mask for TXFRONT_DCOFFSETQ              */
#define _TXFRONT_TXDCOFFSET_DCOFFSETQ_DEFAULT    0x00000000UL                                  /**< Mode DEFAULT for TXFRONT_TXDCOFFSET         */
#define TXFRONT_TXDCOFFSET_DCOFFSETQ_DEFAULT     (_TXFRONT_TXDCOFFSET_DCOFFSETQ_DEFAULT << 16) /**< Shifted mode DEFAULT for TXFRONT_TXDCOFFSET */

/* Bit fields for TXFRONT TXRAMPUP */
#define _TXFRONT_TXRAMPUP_RESETVALUE             0x00002088UL                           /**< Default value for TXFRONT_TXRAMPUP          */
#define _TXFRONT_TXRAMPUP_MASK                   0x0001FFFFUL                           /**< Mask for TXFRONT_TXRAMPUP                   */
#define TXFRONT_TXRAMPUP_MODE                    (0x1UL << 0)                           /**< New BitField                                */
#define _TXFRONT_TXRAMPUP_MODE_SHIFT             0                                      /**< Shift value for TXFRONT_MODE                */
#define _TXFRONT_TXRAMPUP_MODE_MASK              0x1UL                                  /**< Bit mask for TXFRONT_MODE                   */
#define _TXFRONT_TXRAMPUP_MODE_DEFAULT           0x00000000UL                           /**< Mode DEFAULT for TXFRONT_TXRAMPUP           */
#define _TXFRONT_TXRAMPUP_MODE_ENABLED           0x00000000UL                           /**< Mode ENABLED for TXFRONT_TXRAMPUP           */
#define _TXFRONT_TXRAMPUP_MODE_DISABLED          0x00000001UL                           /**< Mode DISABLED for TXFRONT_TXRAMPUP          */
#define TXFRONT_TXRAMPUP_MODE_DEFAULT            (_TXFRONT_TXRAMPUP_MODE_DEFAULT << 0)  /**< Shifted mode DEFAULT for TXFRONT_TXRAMPUP   */
#define TXFRONT_TXRAMPUP_MODE_ENABLED            (_TXFRONT_TXRAMPUP_MODE_ENABLED << 0)  /**< Shifted mode ENABLED for TXFRONT_TXRAMPUP   */
#define TXFRONT_TXRAMPUP_MODE_DISABLED           (_TXFRONT_TXRAMPUP_MODE_DISABLED << 0) /**< Shifted mode DISABLED for TXFRONT_TXRAMPUP  */
#define _TXFRONT_TXRAMPUP_DELAY_SHIFT            1                                      /**< Shift value for TXFRONT_DELAY               */
#define _TXFRONT_TXRAMPUP_DELAY_MASK             0x7FEUL                                /**< Bit mask for TXFRONT_DELAY                  */
#define _TXFRONT_TXRAMPUP_DELAY_DEFAULT          0x00000044UL                           /**< Mode DEFAULT for TXFRONT_TXRAMPUP           */
#define TXFRONT_TXRAMPUP_DELAY_DEFAULT           (_TXFRONT_TXRAMPUP_DELAY_DEFAULT << 1) /**< Shifted mode DEFAULT for TXFRONT_TXRAMPUP   */
#define _TXFRONT_TXRAMPUP_STEP_SHIFT             11                                     /**< Shift value for TXFRONT_STEP                */
#define _TXFRONT_TXRAMPUP_STEP_MASK              0x1F800UL                              /**< Bit mask for TXFRONT_STEP                   */
#define _TXFRONT_TXRAMPUP_STEP_DEFAULT           0x00000004UL                           /**< Mode DEFAULT for TXFRONT_TXRAMPUP           */
#define TXFRONT_TXRAMPUP_STEP_DEFAULT            (_TXFRONT_TXRAMPUP_STEP_DEFAULT << 11) /**< Shifted mode DEFAULT for TXFRONT_TXRAMPUP   */

/* Bit fields for TXFRONT TXDCRAMPUP */
#define _TXFRONT_TXDCRAMPUP_RESETVALUE           0x00000000UL                             /**< Default value for TXFRONT_TXDCRAMPUP        */
#define _TXFRONT_TXDCRAMPUP_MASK                 0xFFFFFFFFUL                             /**< Mask for TXFRONT_TXDCRAMPUP                 */
#define _TXFRONT_TXDCRAMPUP_DELAY_SHIFT          0                                        /**< Shift value for TXFRONT_DELAY               */
#define _TXFRONT_TXDCRAMPUP_DELAY_MASK           0x3FFUL                                  /**< Bit mask for TXFRONT_DELAY                  */
#define _TXFRONT_TXDCRAMPUP_DELAY_DEFAULT        0x00000000UL                             /**< Mode DEFAULT for TXFRONT_TXDCRAMPUP         */
#define TXFRONT_TXDCRAMPUP_DELAY_DEFAULT         (_TXFRONT_TXDCRAMPUP_DELAY_DEFAULT << 0) /**< Shifted mode DEFAULT for TXFRONT_TXDCRAMPUP */
#define _TXFRONT_TXDCRAMPUP_DCRI_SHIFT           10                                       /**< Shift value for TXFRONT_DCRI                */
#define _TXFRONT_TXDCRAMPUP_DCRI_MASK            0x1FFC00UL                               /**< Bit mask for TXFRONT_DCRI                   */
#define _TXFRONT_TXDCRAMPUP_DCRI_DEFAULT         0x00000000UL                             /**< Mode DEFAULT for TXFRONT_TXDCRAMPUP         */
#define TXFRONT_TXDCRAMPUP_DCRI_DEFAULT          (_TXFRONT_TXDCRAMPUP_DCRI_DEFAULT << 10) /**< Shifted mode DEFAULT for TXFRONT_TXDCRAMPUP */
#define _TXFRONT_TXDCRAMPUP_DCRQ_SHIFT           21                                       /**< Shift value for TXFRONT_DCRQ                */
#define _TXFRONT_TXDCRAMPUP_DCRQ_MASK            0xFFE00000UL                             /**< Bit mask for TXFRONT_DCRQ                   */
#define _TXFRONT_TXDCRAMPUP_DCRQ_DEFAULT         0x00000000UL                             /**< Mode DEFAULT for TXFRONT_TXDCRAMPUP         */
#define TXFRONT_TXDCRAMPUP_DCRQ_DEFAULT          (_TXFRONT_TXDCRAMPUP_DCRQ_DEFAULT << 21) /**< Shifted mode DEFAULT for TXFRONT_TXDCRAMPUP */

