SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_txfront.h
/* Bit fields for TXFRONT TXGAIN */
#define _TXFRONT_TXGAIN_RESETVALUE               0x000001FFUL                           /**< Default value for TXFRONT_TXGAIN            */
#define _TXFRONT_TXGAIN_MASK                     0x000003FFUL                           /**< Mask for TXFRONT_TXGAIN                     */
#define _TXFRONT_TXGAIN_GAINDIG_SHIFT            0                                      /**< Shift value for TXFRONT_GAINDIG             */
#define _TXFRONT_TXGAIN_GAINDIG_MASK             0x3FFUL                                /**< Bit mask for TXFRONT_GAINDIG                */
#define _TXFRONT_TXGAIN_GAINDIG_DEFAULT          0x000001FFUL                           /**< Mode DEFAULT for TXFRONT_TXGAIN             */
#define TXFRONT_TXGAIN_GAINDIG_DEFAULT           (_TXFRONT_TXGAIN_GAINDIG_DEFAULT << 0) /**< Shifted mode DEFAULT for TXFRONT_TXGAIN     */

/* Bit fields for TXFRONT TXCLIP */
#define _TXFRONT_TXCLIP_RESETVALUE               0x080007FFUL                            /**< Default value for TXFRONT_TXCLIP            */
#define _TXFRONT_TXCLIP_MASK                     0x0FFF0FFFUL                            /**< Mask for TXFRONT_TXCLIP                     */
#define _TXFRONT_TXCLIP_CLIPPOS_SHIFT            0                                       /**< Shift value for TXFRONT_CLIPPOS             */
#define _TXFRONT_TXCLIP_CLIPPOS_MASK             0xFFFUL                                 /**< Bit mask for TXFRONT_CLIPPOS                */
#define _TXFRONT_TXCLIP_CLIPPOS_DEFAULT          0x000007FFUL                            /**< Mode DEFAULT for TXFRONT_TXCLIP             */
#define TXFRONT_TXCLIP_CLIPPOS_DEFAULT           (_TXFRONT_TXCLIP_CLIPPOS_DEFAULT << 0)  /**< Shifted mode DEFAULT for TXFRONT_TXCLIP     */
#define _TXFRONT_TXCLIP_CLIPNEG_SHIFT            16                                      /**< Shift value for TXFRONT_CLIPNEG             */
#define _TXFRONT_TXCLIP_CLIPNEG_MASK             0xFFF0000UL                             /**< Bit mask for TXFRONT_CLIPNEG                */
#define _TXFRONT_TXCLIP_CLIPNEG_DEFAULT          0x00000800UL                            /**< Mode DEFAULT for TXFRONT_TXCLIP             */
#define TXFRONT_TXCLIP_CLIPNEG_DEFAULT           (_TXFRONT_TXCLIP_CLIPNEG_DEFAULT << 16) /**< Shifted mode DEFAULT for TXFRONT_TXCLIP     */

/* Bit fields for TXFRONT TXPREDIST */
#define _TXFRONT_TXPREDIST_RESETVALUE            0x00000000UL                               /**< Default value for TXFRONT_TXPREDIST         */
#define _TXFRONT_TXPREDIST_MASK                  0x3FFF3FFFUL                               /**< Mask for TXFRONT_TXPREDIST                  */
#define _TXFRONT_TXPREDIST_BETAAMP_SHIFT         0                                          /**< Shift value for TXFRONT_BETAAMP             */
#define _TXFRONT_TXPREDIST_BETAAMP_MASK          0x3FFFUL                                   /**< Bit mask for TXFRONT_BETAAMP                */
#define _TXFRONT_TXPREDIST_BETAAMP_DEFAULT       0x00000000UL                               /**< Mode DEFAULT for TXFRONT_TXPREDIST          */
#define TXFRONT_TXPREDIST_BETAAMP_DEFAULT        (_TXFRONT_TXPREDIST_BETAAMP_DEFAULT << 0)  /**< Shifted mode DEFAULT for TXFRONT_TXPREDIST  */
#define _TXFRONT_TXPREDIST_BETAPHA_SHIFT         16                                         /**< Shift value for TXFRONT_BETAPHA             */
#define _TXFRONT_TXPREDIST_BETAPHA_MASK          0x3FFF0000UL                               /**< Bit mask for TXFRONT_BETAPHA                */
#define _TXFRONT_TXPREDIST_BETAPHA_DEFAULT       0x00000000UL                               /**< Mode DEFAULT for TXFRONT_TXPREDIST          */
#define TXFRONT_TXPREDIST_BETAPHA_DEFAULT        (_TXFRONT_TXPREDIST_BETAPHA_DEFAULT << 16) /**< Shifted mode DEFAULT for TXFRONT_TXPREDIST  */

/* Bit fields for TXFRONT DAC */
#define _TXFRONT_DAC_RESETVALUE                  0x00000002UL                            /**< Default value for TXFRONT_DAC               */
#define _TXFRONT_DAC_MASK                        0x00000003UL                            /**< Mask for TXFRONT_DAC                        */
#define TXFRONT_DAC_CONNECTTEST                  (0x1UL << 0)                            /**< New BitField                                */
#define _TXFRONT_DAC_CONNECTTEST_SHIFT           0                                       /**< Shift value for TXFRONT_CONNECTTEST         */
#define _TXFRONT_DAC_CONNECTTEST_MASK            0x1UL                                   /**< Bit mask for TXFRONT_CONNECTTEST            */
#define _TXFRONT_DAC_CONNECTTEST_DEFAULT         0x00000000UL                            /**< Mode DEFAULT for TXFRONT_DAC                */
#define _TXFRONT_DAC_CONNECTTEST_NO              0x00000000UL                            /**< Mode NO for TXFRONT_DAC                     */
#define _TXFRONT_DAC_CONNECTTEST_YES             0x00000001UL                            /**< Mode YES for TXFRONT_DAC                    */
#define TXFRONT_DAC_CONNECTTEST_DEFAULT          (_TXFRONT_DAC_CONNECTTEST_DEFAULT << 0) /**< Shifted mode DEFAULT for TXFRONT_DAC        */
#define TXFRONT_DAC_CONNECTTEST_NO               (_TXFRONT_DAC_CONNECTTEST_NO << 0)      /**< Shifted mode NO for TXFRONT_DAC             */
#define TXFRONT_DAC_CONNECTTEST_YES              (_TXFRONT_DAC_CONNECTTEST_YES << 0)     /**< Shifted mode YES for TXFRONT_DAC            */
#define TXFRONT_DAC_DACFORMAT                    (0x1UL << 1)                            /**< New BitField                                */
#define _TXFRONT_DAC_DACFORMAT_SHIFT             1                                       /**< Shift value for TXFRONT_DACFORMAT           */
#define _TXFRONT_DAC_DACFORMAT_MASK              0x2UL                                   /**< Bit mask for TXFRONT_DACFORMAT              */
#define _TXFRONT_DAC_DACFORMAT_DEFAULT           0x00000001UL                            /**< Mode DEFAULT for TXFRONT_DAC                */
#define _TXFRONT_DAC_DACFORMAT_SIGNED            0x00000000UL                            /**< Mode SIGNED for TXFRONT_DAC                 */
#define _TXFRONT_DAC_DACFORMAT_UNSIGNED          0x00000001UL                            /**< Mode UNSIGNED for TXFRONT_DAC               */
#define TXFRONT_DAC_DACFORMAT_DEFAULT            (_TXFRONT_DAC_DACFORMAT_DEFAULT << 1)   /**< Shifted mode DEFAULT for TXFRONT_DAC        */
#define TXFRONT_DAC_DACFORMAT_SIGNED             (_TXFRONT_DAC_DACFORMAT_SIGNED << 1)    /**< Shifted mode SIGNED for TXFRONT_DAC         */
#define TXFRONT_DAC_DACFORMAT_UNSIGNED           (_TXFRONT_DAC_DACFORMAT_UNSIGNED << 1)  /**< Shifted mode UNSIGNED for TXFRONT_DAC       */

/** @} End of group EFR32FG25_TXFRONT_BitFields */
/** @} End of group EFR32FG25_TXFRONT */
/** @} End of group Parts */

#endif /* EFR32FG25_TXFRONT_H */
